export const services: Record<string, string[]> = {
	'Сімейне право': [
		'Розірвання шлюбу',
		'Стягнення аліментів',
		'Позбавлення батьківських прав',
		'Шлюбний договір та контракт',
		'Встановлення місця проживання дитини з одним з батьків',
		'Поділ спільного майна подружжя'
	],
	'Військове право': [
		'Оформлення відстрочки від мобілізації',
		'Звільнення з військової служби або переміщення',
		'Оскарження постанов військово-лікарської комісії',
		'Отримання компенсаційних виплат чинним військовим'
	],
	'Адміністративне право': [
		'Оскарження дій або бездіяльності субʼєкта владних повноважень',
		'Консультації з подання та змін до декларацій (НАЗК)',
		'Оскарження постанов при вчинення корупційних правопорушень'
	],
	'Адміністративні провадження': [
		'Оскарження адміністративних протоколів та постанов (ДТП, керування транспортним засобом у стані алкогольного спʼяніння, тощо)',
		'Захист у справах про адміністративне правопорушення'
	],
	'Цивільне право': [
		'Цивільні спори',
		'Стягнення заборгованості',
		'Захист прав споживачів',
		'Купівля-продаж нерухомості',
		'Допомога при ДТП',
		'Земельні та житлові спори',
		'Спори з фінансовими та банківськими установами',
		'Спадкування',
		'Вступ у спадщину',
		'Захист інтелектуальної власності',
		'Зняття арешту з майна',
		'Виконавче провадження',
		'Захист інвестицій'
	],
	'Господарське право': [
		'Корпоративні спори',
		'Захист інвестицій',
		'Захист бізнесу від рейдерства',
		'Стягнення за договором поставки',
		'Ліквідація юридичної особи',
		'Захист честі, гідності та ділової репутації',
		'Банкрутство',
		'Захист інтелектуальної власності',
		'Захист криптовалютних інвестицій'
	],
	'Міграційне право та юридична допомога за кордоном': [
		'Перетин кордону',
		'Міграційні послуги',
		'Послуги з відкриття юридичної особи за кордоном',
		'Укладання шлюбу за кордоном',
		'Представництво інтересів у консульських установах'
	],
	'Кримінальне право': [
		'Захист у кримінальному провадженні',
		'Захист під час досудового розслідування',
		'Захист інтересів під час тимчасового затримання особи, арешту майна та застосування інших заходів забезпечення',
		'Представництво під час проведення слідчих дій',
		'Надання консультацій на будь-якому етапі провадження'
	]
};

// Утиліти
export const getAllServices = () => Object.values(services).flat();
export const getCategories = () => ['Все', ...Object.keys(services)];
export const getServicesByCategory = (category: string) =>
	category === 'Все'
		? getAllServices()
		: services[category]
		|| [];
