<script lang="ts">
	import { fadeOnVisible } from '$lib/fadeOnVisible';
	import ArrowRightIcon from '$lib/icons/ArrowRightIcon.svelte';
	import { fade, slide } from 'svelte/transition';

	let isShowInfo = $state(false)
	let teamLilia: HTMLDivElement;
		
	function toggleInfo() {
		// Якщо інформація зараз показана (тобто ми її ховаємо)
		if (isShowInfo) {
			// Скролимо до початку цього компонента
			teamLilia.scrollIntoView({ behavior: 'smooth', block: 'start' });
		}
		isShowInfo = !isShowInfo;
	}
</script>

<div class="team-container-reverse" bind:this={teamLilia}>
	<picture class="max-w-full" use:fadeOnVisible>
		<source srcset="/img/our-team-five.webp" type="image/webp" />
		<img
			class="team-img"
			loading="lazy"
			width="510"
			height="596"
			src="/img/our-team-five.jpg"
			alt="Team five"
		/>
	</picture>

	<div class="color-292424 xl:w-1/2">
		<h6 class="team-title" use:fadeOnVisible >Лілія Братим</h6>

		<span class="team-subtitle" use:fadeOnVisible>Старший консультант</span>

		<p class="our-team-p" use:fadeOnVisible>
			<span class="font-semibold">Професійний досвід:</span>
			<br class="hidden xl:block" />
			Лілія Братим розпочала свою юридичну кар’єру у 2004 році у відділі економіки слідчого відділу Міністерства
			внутрішніх справ України. За час своєї кар’єри вона обіймала різні посади, включаючи старшого слідчого
			та роботу в міграційній службі України.
		</p>

		<div class="hidden xl:block">
			<p class="our-team-p" use:fadeOnVisible>
				<span class="font-semibold">Спеціалізація:</span>
				<br />
				Лілія спеціалізується на міжнародному праві, зовнішньоекономічній діяльності, міграційному праві,
				консульських і дипломатичних зносинах. Вона також має великий досвід у сфері бізнесу та електронної
				комерції, включаючи крипто право та ІТ право.
			</p>

			<p class="our-team-p" use:fadeOnVisible>
				<span class="font-semibold">Досвід:</span>
				<br />
				З 20-річним стажем у юридичній практиці, Лілія втілює юридичну майстерність та міжнародний досвід.
				Вона не тільки розуміє закони, але й передбачає їх вплив на ваш бізнес та життя.
			</p>

			<p class="our-team-p" use:fadeOnVisible>
				<span class="font-semibold">Чому обрати Лілію?</span>
				<br />
				Лілія володіє кількома мовами, включаючи англійську, німецьку, турецьку та грузинську, і є стратегічним
				партнером у сфері міжнародного права, економіки та бізнесу. Вона має глибокі знання та практичний
				досвід у Європейському Союзі, країнах Кавказу та Азії, зокрема у бізнесі та електронній комерції.
				Її робота в Грузії, Туреччині, Китаї та країнах ЄС надає їй унікальний інсайт, який вона використовує
				для захисту інтересів своїх клієнтів.
				<br />
				<br />
				У світі, де криптовалюта та ІТ право стають все більш актуальними, Лілія пропонує передові рішення
				у цих швидко розвиваючихся галузях. Вона забезпечує захист ваших інтересів на крипто-платформах
				та кібербезпеку, допомагає розуміти оподаткування та легально працювати в різних країнах світу.
				Лілія - експерт, який не тільки виведе вас зі складних юридичних лабіринтів, але й допоможе будувати
				міцний фундамент для вашого майбутнього успіху у бізнесі та інвестиціях.
			</p>
		</div>

		<div class="xl:hidden">
			{#if isShowInfo}
				<div transition:slide>
					<div class="flex flex-col" transition:fade>
						<p class="our-team-p" use:fadeOnVisible>
							<span class="font-semibold">Спеціалізація:</span>

							Лілія спеціалізується на міжнародному праві, зовнішньоекономічній діяльності, міграційному
							праві, консульських і дипломатичних зносинах. Вона також має великий досвід у сфері бізнесу
							та електронної комерції, включаючи крипто право та ІТ право.
						</p>

						<p class="our-team-p" use:fadeOnVisible>
							<span class="font-semibold">Досвід:</span>

							З 20-річним стажем у юридичній практиці, Лілія втілює юридичну майстерність та міжнародний
							досвід. Вона не тільки розуміє закони, але й передбачає їх вплив на ваш бізнес та життя.
						</p>

						<p class="our-team-p" use:fadeOnVisible>
							<span class="font-semibold">Чому обрати Лілію:</span>

							Лілія володіє кількома мовами, включаючи англійську, німецьку, турецьку та грузинську, і
							є стратегічним партнером у сфері міжнародного права, економіки та бізнесу. Вона має глибокі
							знання та практичний досвід у Європейському Союзі, країнах Кавказу та Азії, зокрема у бізнесі
							та електронній комерції. Її робота в Грузії, Туреччині, Китаї та країнах ЄС надає їй унікальний
							інсайт, який вона використовує для захисту інтересів своїх клієнтів.
						</p>

						<p class="our-team-p" use:fadeOnVisible>
							У світі, де криптовалюта та ІТ право стають все більш актуальними, Лілія пропонує
							передові рішення у цих швидко розвиваючихся галузях. Вона забезпечує захист ваших
							інтересів на крипто-платформах та кібербезпеку, допомагає розуміти оподаткування та
							легально працювати в різних країнах світу. Лілія - експерт, який не тільки виведе вас зі
							складних юридичних лабіринтів, але й допоможе будувати міцний фундамент для вашого
							майбутнього успіху у бізнесі та інвестиціях.
						</p>
					</div>
				</div>
			{/if}

			<button
				class="read-more-btn color-7d7e7e"
				onclick={toggleInfo}
				aria-label={isShowInfo ? 'Показати інформацію' : 'Сховати інформацію'}
				title={isShowInfo ? 'Показати інформацію' : 'Сховати інформацію'}
			>
				{#if isShowInfo}
					<span> Сховати </span>
				{:else}
					<span class="flex items-end">
						Читати далі

						<i>
							<ArrowRightIcon />
						</i>
					</span>
				{/if}
			</button>
		</div>
	</div>
</div>
